/*
 * ATtinyVCO.c
 *
 * Created: 2015/11/25 14:07:46
 *  Author: gizmo
 */ 

#define F_CPU	9600000ul

#include <avr/io.h>
#include <avr/pgmspace.h>
#include <util/delay.h>
#include <stdint.h>

#define SAMPLE_CLOCK	(8000.0f)
#define POW_2_16		(65536ul)

#define FREQUENCY_MAX	(2000.0f)

// Saw dawn wave up table
const PROGMEM uint8_t sawUpTable[] = {
	0,	1,	2,	3,	4,	5,	6,	7,	8,	9,	10,	11,	12,	13,	14,	15,
	16,	17,	18,	19,	20,	21,	22,	23,	24,	25,	26,	27,	28,	29,	30,	31,
	32,	33,	34,	35,	36,	37,	38,	39,	40,	41,	42,	43,	44,	45,	46,	47,
	48,	49,	50,	51,	52,	53,	54,	55,	56,	57,	58,	59,	60,	61,	62,	63,
	64,	65,	66,	67,	68,	69,	70,	71,	72,	73,	74,	75,	76,	77,	78,	79,
	80,	81,	82,	83,	84,	85,	86,	87,	88,	89,	90,	91,	92,	93,	94,	95,
	96,	97,	98,	99,	100,	101,	102,	103,	104,	105,	106,	107,	108,	109,	110,	111,
	112,	113,	114,	115,	116,	117,	118,	119,	120,	121,	122,	123,	124,	125,	126,	127
};

volatile uint16_t phaseAccumlator;
volatile uint16_t tuningWord;
volatile uint8_t amp;

//=============================================================================
// 波形生成
//
// ----------------------------------------------------------------------------
// setDDSParameter()
// parameter: frequency: 生成する周波数
//
void setDDSParameter(float frequency)
{
	tuningWord = (int16_t)(frequency * POW_2_16 / SAMPLE_CLOCK);
}

// ----------------------------------------------------------------------------
// generateWave()
// return: 出力値(0..255)
//
uint8_t generateSawWave()
{
	uint8_t index;
	
	phaseAccumlator += tuningWord;
	
	// 右へシフト: 16bit -> 7bit(128個)
	index = phaseAccumlator >> 8;
	return pgm_read_byte(&sawUpTable[index]);
}

//=============================================================================
// 波形生成
//
// ----------------------------------------------------------------------------
// setPWMDuty()
// parameter: value: 設定するDuty比(0..255)
//
void setPWMDuty(uint8_t value)
{
	// PWMのデューティー比を設定
	OCR0A = value;
}

//=============================================================================
// ADC
//
// ----------------------------------------------------------------------------
// getCV()
// return: CV値(0..4095)
//
uint16_t getCV() {
	// ADC_CVの値を取得
	return 2048;
}

// ----------------------------------------------------------------------------
// getGate()
// return: Gate値(0..255)
//
uint8_t getGate() {
	// ADC_GATEの値を取得
	return 255;
}

//=============================================================================
// ラッチ割込み
//
//ISR()
//	generateSawWave()を呼び出し
//	amp値を乗算
//	PWM DACに出力値を設定

//=============================================================================
// メイン・ルーチン
//
int main()
{
	uint16_t cv;
	uint8_t v;
	
	//-------------------------------------------------------------------------
	// PORT設定
	//-------------------------------------------------------------------------
	DDRB = 0b00000001;	// PB0(OC0A): PWM out
	// Debug用
	//
	DDRB |= 0b00000010;	// PB1
	
	//-------------------------------------------------------------------------
	// PWM設定
	//-------------------------------------------------------------------------
	// TCCR0A = 0;
	// TCCR0B = 0;
	//-------------------------------------------------------------------------
	// 波形生成モード: WGM0: 0:1:1
	// 高速PWM(モード3)
	TCCR0A |= (1 << WGM01) | (1 << WGM00);
	TCCR0B |= (0 << WGM02);
	//-------------------------------------------------------------------------
	// コンペア・アウトプットA: COM0A: 1:0
	// コンペア・マッチでOC0Aクリア、TOPでOC0Aセット
	TCCR0A |= (1 << COM0A1) | (0 << COM0A0);
	//-------------------------------------------------------------------------
	// クロック設定: CS0: 0:0:1
	// 分周なし
	TCCR0B |= (0 << CS02) | (0 << CS01) | (1 << CS00);
	
	// TCCR0A = 0b10000011;
	// TCCR0B = 0B00000010;
	
	// 初期設定 1kHz Duty:50%
	//
	//setDDSParameter(1000.f);
	//setPWMDuty(127);
	
	for (;;) {
		// Debug用: PB1
		PORTB |= 0b00000010;
		
		cv = getCV();
		setDDSParameter(cv * FREQUENCY_MAX / 4096.0f);
		amp = getGate();
		v = generateSawWave();
		setPWMDuty(v);
		
		// Debug用: PB1
		PORTB &= 11111101;
		
		_delay_us(125);	// 8,000Hz
	}
}
// EOF